// This is a query written in response to Crowdstrike discovery here: https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/
// They will most likely add IOC's to that list, so this query might eventually get outdated and you might want to look at their post for the latest IOC's.

// As the program is communicating externally to C2 servers, run this query to see if you have any traffic in your environment towards that C2 infrastructure
// If you get this on this query, it means you are compromised by this
DeviceNetworkEvents
| where Timestamp > ago(30d)
| where RemoteUrl has_any("msstorageazure.com", "akamaicontainer.com", "qwepoi123098.com", "dunamistrd.com", "msedgepackageinfo.com", "akamaitechcloudservices.com", "pbxcloudeservices.com", "officeaddons.com", "sourceslabs.com", "msstorageboxes.com", "pbxphonenetwork.com", "journalide.org", "pbxsources.com", "msstorageboxes.com", "officestoragebox.com", "glcloudservice.com", "akamaitechcloudservices.com", "sourceslabs.com", "msedgepackageinfo.com", "pbxcloudeservices.com", "pbxphonenetwork.com", "officeaddons.com", "azureonlinestorage.com", "visualstudiofactory.com", "msstorageazure.com", "akamaicontainer.com", "azureonlinecloud.com", "zacharryblogs.com", "azuredeploystore.com", "sbmsa.wiki", "journalide.org")

// In a Microsoft environment you got several options when it comes to software inventory, you should get the inventory in Defender (security.microsoft.com -> Vulnerability Management -> Inventory) to see if you have this installed somewhere
// You can also run this query, which will trigger on the existance of these files
// NOTE: If this query hits, it does NOT mean you have been compromised, only that you have these files in your environment
union DeviceProcessEvents, DeviceFileEvents
| where Timestamp > ago(30d)
| where SHA256 has_any("dde03348075512796241389dfea5560c20a3d2a2eac95c894e7bbed5e85a0acc", "fad482ded2e25ce9e1dd3d3ecc3227af714bdfbbde04347dbc1b21d6a3670405", "92005051ae314d61074ed94a52e76b1c3e21e7f0e8c1d1fdd497a006ce45fa61", "b86c695822013483fa4e2dfdf712c5ee777d7b99cbad8c2fa2274b133481eadb", "aa124a4b4df12b34e74ee7f6c683b2ebec4ce9a8edcf9be345823b4fdcf5d868", "59e1edf4d82fae4978e97512b0331b7eb21dd4b838b850ba46794d9c7a2c0983", "5407cda7d3a75e7b1e030b1f33337a56f293578ffa8b3ae19c671051ed314290", "e6bbc33815b9f20b0cf832d7401dd893fbc467c800728b5891336706da0dbcec")
or FileName has_any("3cxdesktopapp-18.12.407.msi", "3cxdesktopapp-18.12.416.msi", "3CXDesktopApp-18.11.1213.dmg", "3cxdesktopapp-latest.dmg")

