// Intent: Search for IOC's related to the Red Stinger threat actor 
// IOC's taken from the great writeup from Malwarebytes on Red Stinger here: https://www.malwarebytes.com/blog/threat-intelligence/2023/05/redstinger
// Nothing special about this query, it's just to save you time from having to take the IOC's from the article and write it yourself 
//
union DeviceFileEvents, DeviceNetworkEvents
| where RemoteIP has_any ("185.166.217.184", "45.154.116.147", "176.114.9.192", "185.230.90.163", "91.234.33.108", "91.234.33.185")
or SHA256 has_any ("9a6d4ac64fa6645c58a19b8c8795a8cb586b82f6a77aaf8f06eb83ba1f1390e8","9e73dacedf847410dd4a0caa6aac83d31f848768336514335d4872d0fde2802","B6491d99d7193499a320bf6ad638146193af2ced6128afe8af3666a828f1b900","Bc93ef8e20f2a9a8799934d629fe494d5d82ea49e06ed8fb00ea6cc2e9f407e","82e4b4fddf5ea7b7c846d44bcc24d75edcec5726dfa5b81b9f43387a1fc1922a","052309916380ef609cacb7bafbd71dc54b57f72910dca9e5f041920dba3841d","D6b5f48d4e94207a5a192c1784f9f121b59311bfd6a5e94be7c55b0108c4ed93","4a5f9f62ef8dfae47b164a4d46d242a19a11061284325e560df2b4da44bb97d","70801ef4f485ba4eb8a76da0d50fc53563d82fdf37951b421b3ae864a04ccd1c","Ce9af73be2981c874b37b767873fa4d47219810e2672bf7e05af8c865448069","Fb48b9102388620bb02d1a47297ba101f755632f9a421d09e9ab419cbeb65db8","C75d905cd7826182505c15d39ebe952dca5b4c80fb62b87283fa09d7f51c815","D956f2bf75d2fe9bf0d7c319b22a834976f1786b09ff1bba0d2e26c771b19ca2","41589c4e712690af11f6d12efc6cca2d584a5314278e5f2c677b4e980fae5bd","9c16cf1f962bf736e3d6fb9ec3a37bb6f92c5f6cb1886d4332694ccc94735de8","4808815cb03b5f31841c74755897b65ed03e56dbdbe0d1fed06af3710f32d51","2ac977e6883405e68671d523eab41fe4162b0a20fac259b201ac460a691d3f79","C68ce59f73c3d5546d500a296922d955ccc5782b16ce4bd245ca93de3e32366","78634be886ccb3949c8e5b8f0893cff32c474a466e4d4ceba35ba05c3d373bff","78634be886ccb3949c8e5b8f0893cff32c74a466e4d4ceba35ba05c3d373bff","961c52567232c1f98c04b1e605c34b0309ff280afe01e1a31384589e30eccf05","22bb73e97b01be2e11d741f3f485238b3dae91d9ac511f33de8877a9e7c0534","301e819008e19b9803ad8b75ecede9ecfa5b11a3ecd8df0316914588b95371c8","F405a26904d2f6aaf4ff5f24dc34a24751d13b691a0bf17ba8c94f08ebb8b5b","Aa0e722832b1a039c96fd9ff169df8f48419f48e1dacf88633a5c561e6db0ba5","8aa19e3654f6c26b6c564a810781174abc540384b20f645e87531c754814cf1","0e4b133fe7562fe5a65a8b7463f0c4f69d951f18d351cafe44e5cae393392057","332f6e99403841998f950c2543b4a54c78aace2a2e1901b08917f63c7faa2f4","F7437b4b011e57394c264ed42bb46ad6f2c6899f9ca62f507bebbff29f2a3d3f","Dfc1e73685d3f11a3c6a50bb023532963807193169d185584f287aa8ce22a8b","Fbe650223893284282e0be8f7719b554ff7a1d9fbbc72d3e17a47a9a1ceb6231","Dfa442780702863b5c71af0c475743eef754743c3d0336ff8c5032a30f30dc0","12f16409b6191e3b2c5fd874cca5010711347d28900c108506dbc7f4d403c365","2643B38BDAD8968BAEA4226DD6496B91ED283330B2C5D8CA134BEFA796E0F34","1FA2B3315FB2A12E65FD5258D1395597101F225E7BC204F672BCF253C82AEA55","B2c2b232bc3c8feb22b689e44ce2fb5bf85f228fef665f2f1517e542e9906c6","A924dd46b6793ec82e1f32e3fb4215295e21c61eaafc7995cb08c20c5fbadc47")
